Documents/ВозвратПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВозвратПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.Возвраты</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарьЗакупки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_АвтоматическийПоиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПлатежныйКалендарьЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПлатежныйКалендарьЗакупки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Поставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Поставки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Долги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДолгПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Чем</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасходыДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасходыДоходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВозвратПоставщику/Ext/ObjectModule.bsl
Процедура ПересчитатьСтроку(Стр)
	Стр.Серия = Стр.Партия.Серия;
	Стр.ЦенаЗакупки = Стр.Партия.ЦенаЗакупки;
	Стр.СуммаЗакупки = Стр.ЦенаЗакупки * Стр.Количество;
КонецПроцедуры

Процедура ПересчитатьИтоги()
	Сумма = Товары.Итог("СуммаЗакупки");
	Строк = Товары.Количество();
	СуммаПривязано = Привязки.Итог("Сумма1");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// © Primus1C  02.04.2025  НАЧАЛО ►
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Фирма) Тогда Фирма = гоФирма() КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	//КемСохранен = гоПользователь();
	//Сохранен = ТекущаяДата();
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
	БылФлагНеПроверятьОстатки = ФлагНеПроверятьОстатки;
	Если (БылФлагНеПроверятьОстатки = 1) ИЛИ (БылФлагНеПроверятьОстатки = 9) Тогда 
		ФлагНеПроверятьОстатки = 2;
		Если БылФлагНеПроверятьОстатки = 9 Тогда Возврат КонецЕсли; 
	ИначеЕсли БылФлагНеПроверятьОстатки = 2 Тогда 
		ФлагНеПроверятьОстатки = 0;
	КонецЕсли;
	
	Для Каждого Стр Из Товары Цикл
		ПересчитатьСтроку(Стр);
	КонецЦикла;
	ПересчитатьИтоги();
	
	СуммаКР = 0;
	Для Каждого Стр Из Привязки Цикл
		правильнаяСумма = омСервер.ПересчетЗн(Стр.Сумма2, Стр.Валюта2, Валюта, Фирма, Дата, 2);
		//тут приход в кассу, считаем, как для оплаты покупателя
		Если правильнаяСумма <> Стр.Сумма1 Тогда гоПлюс(СуммаКР, Стр.Сумма1 - правильнаяСумма) КонецЕсли; 
	КонецЦикла;  
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = глПрефиксДефис(Фирма);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	Привязки.Очистить();
	СуммаПривязано = 0;
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда Склад = Мас[0] КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	Привязки.Очистить();
	СуммаПривязано = 0;
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда Склад = Мас[0] КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если (ФлагНеПроверятьОстатки <> 2) И (Товары.Количество() > 0) Тогда  
		НадоЗаписать = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
			|ВЫБРАТЬ
			|	МИНИМУМ(ДокТовары.НомерСтроки) КАК НомерСтроки,
			|	ДокТовары.Номенклатура КАК Номенклатура,
			|	ДокТовары.Партия КАК Партия,
			|	СУММА(ДокТовары.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТТовары
			|ИЗ
			|	Документ.ВозвратПоставщику.Товары КАК ДокТовары
			|ГДЕ
			|	ДокТовары.Ссылка = &Ссылка
			|СГРУППИРОВАТЬ ПО
			|	ДокТовары.Номенклатура,
			|	ДокТовары.Партия
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Партия
			|;
			|ВЫБРАТЬ
			|	ВТТовары.НомерСтроки,
			|	ВТТовары.Номенклатура,
			|	ВТТовары.Партия,
			|	ВТТовары.Количество,
			|	ЕСТЬNULL(ОстПар.ОстатокОстаток, 0) КАК Остаток
			|ИЗ
			|	ВТТовары КАК ВТТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки( , Партия В
			|					(ВЫБРАТЬ
			|						Т.Партия
			|					ИЗ
			|						ВТТовары КАК Т) И Склад = &Склад И Фирма = &Фирма) КАК ОстПар
			|		ПО ВТТовары.Партия = ОстПар.Партия
			|";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Фирма", Фирма);
		
		Исправлений = 0;
		Первое = Истина;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.Партия) Тогда Продолжить КонецЕсли; 
			
			Если Выборка.Количество <= Выборка.Остаток Тогда Продолжить КонецЕсли; 
			Если Первое Тогда Сообщить("Проведение " + Ссылка + " - не хватило остатков партий:"); Первое = Ложь; КонецЕсли; 
			
			Сообщить(гоИмя(Выборка.Партия) + ": количество = " + Выборка.Количество + " больше остатка = " + Выборка.Остаток + "! ИСПРАВЛЕНО!!!");
			
			БылоКолво = Выборка.Количество;		 	
			Колич = Выборка.Остаток;
			Номен = Выборка.Партия.Владелец;
			гоЗаписьЖурналаРегистрации(Строка(БылоКолво) + "->" + Строка(Колич) + "|" + гоИмя(Ссылка, Ложь), "Возврат поставщику", "Не хватило при проведении", Номен, 2);
			гоЗаписьЖурналаРегистрации(Строка(БылоКолво) + "->" + Строка(Колич) + "|" + гоИмя(Номен, Ложь), "Возврат поставщику", "Не хватило при проведении", Ссылка, 2);
			
			локОстаток = Выборка.Остаток;
			Если локОстаток < 0 Тогда локОстаток = 0 КонецЕсли;
			Отнять = Выборка.Количество - локОстаток;
			
			Нашли = Товары.НайтиСтроки(Новый Структура("Партия", Выборка.Партия));
			Если Нашли.Количество() = 0 Тогда Отказ = Истина; Сообщить("Странная ошибка! Вообще не нашли " + гоИмя(Выборка.Партия)); Возврат; КонецЕсли; 
			
			Для Каждого Лтр Из Нашли Цикл
				Если Лтр.Количество >= Отнять Тогда
					Лтр.Количество = Лтр.Количество - Отнять;
					Отнять = 0;
				Иначе
					Отнять = Отнять - Лтр.Количество;
					Лтр.Количество = 0;
				КонецЕсли; 
				Исправлений = Исправлений + 1;
				Если Отнять = 0 Тогда Прервать КонецЕсли; 
			КонецЦикла; 
			
			Если Отнять <> 0 Тогда Отказ = Истина; Сообщить("Странная ошибка! Не смогли уменьшить количество на " + Отнять + " для " + гоИмя(Выборка.Партия)); Возврат; КонецЕсли; 
		КонецЦикла;
		
		НадоЗаписать = НЕ (Исправлений = 0);
		Если НадоЗаписать Тогда Записать(РежимЗаписиДокумента.Запись) КонецЕсли; 
	КонецЕсли; 
	
    ЕстьОстатки = Ложь;
    ЕстьРезервы = Ложь;
	ЕстьДолги = Ложь;
	ЕстьНезакрытые = Ложь;
	ЕстьРасходыДоходы = Ложь;
	ЕстьПоставки = Ложь;
	ЕстьПлатежныйКалендарь = Ложь;
	
	Для Каждого Стр Из Товары Цикл
		Если Стр.Количество = 0 Тогда Продолжить КонецЕсли; 
		
		//+ 
		лИнвойс = Стр.Партия.Док.ВКД_Инвойс.ДокументОснование; 
		Если ЗначениеЗаполнено(лИнвойс) Тогда
			Движение = Движения.ПлатежныйКалендарьЗакупки.ДобавитьРасход();
			Движение.Период			= Дата;
			Движение.Контрагент 	= Контрагент; 
			Движение.Инвойс			= лИнвойс;
			Движение.Сумма			= Сумма;
			Движение.Валюта			= Валюта;
			Движение.ДатаОплаты		= лИнвойс.ДатаОплаты;
			Движение.ДатаПрибытия	= лИнвойс.ДатаНаСкладеОтправителя; 
			ЕстьПлатежныйКалендарь = Истина;      
		КонецЕсли;
		//-
		
		Движение = Движения.ОстаткиТовара.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Фирма = Фирма;
		Движение.Склад = Склад;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Партия = Стр.Партия;
		Движение.Остаток = - Стр.Количество;
		Движение.Резерв = 0;
		ЕстьОстатки = Истина;
		
		Если НЕ Окончательно Тогда
			Движение = Движения.ОстаткиТовара.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Склад = Склад;
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Партия = Стр.Партия;
			Движение.Остаток = 0;
			Движение.Резерв = Стр.Количество;
			ЕстьОстатки = Истина;
			
			//Движение = Движения.РезервыТовара.ДобавитьПриход();
			//Движение.Период = Дата;
			//Движение.Фирма = Фирма;
			//Движение.Склад = Склад;
			//Движение.Номенклатура = Стр.Номенклатура;
			//Движение.Партия = Стр.Партия;
			//Движение.Док = Ссылка;
			//Движение.Остаток = Стр.Количество;
			//ЕстьРезервы = Истина;
		Иначе
			Движение = Движения.Поставки.Добавить();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Валюта = Валюта;
			Движение.Поставщик = Контрагент;
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Количество = - Стр.Количество;
			Движение.Сумма = - Стр.СуммаЗакупки;
			ЕстьПоставки = Истина;
		КонецЕсли; 
	КонецЦикла;

	Если Окончательно Тогда
		Для Каждого Стр Из Привязки Цикл
			Если Стр.ЭтоПредоплата Тогда
				Движение = Движения.Долги.ДобавитьПриход();
			Иначе
				Движение = Движения.Долги.ДобавитьРасход();
			КонецЕсли; 
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Док = Стр.Док2;
			Движение.Валюта = Стр.Валюта2;
			Движение.Контрагент = Контрагент;
			Движение.ДолгПокупателя = 0;
			Движение.ПредоплатаПокупателя = 0;
			Движение.ДолгПоставщику = ?(Стр.ЭтоПредоплата, 0, Стр.Сумма2);
			Движение.ПредоплатаПоставщику = ?(Стр.ЭтоПредоплата, Стр.Сумма2, 0);
			Движение.Чем = Ссылка;
			ЕстьДолги = Истина;
		КонецЦикла; 
		
		Предоплата = Сумма - СуммаПривязано;
		
		Движение = Движения.Долги.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Фирма = Фирма;
		Движение.Док = Ссылка;
		Движение.Валюта = Валюта;
		Движение.Контрагент = Контрагент;
		Движение.ДолгПокупателя = 0;
		Движение.ПредоплатаПокупателя = 0;
		Движение.ДолгПоставщику = 0;
		Движение.ПредоплатаПоставщику = Предоплата;
		Движение.Чем = 0;
		ЕстьДолги = Истина;
		
		//универсально, независимо от типа, проводим КР, если они есть
		Если СуммаКР <> 0 Тогда
			Движение = Движения.РасходыДоходы.Добавить();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Статья = ?(СуммаКР < 0, Справочники.Статьи.РасходОтКР, Справочники.Статьи.ДоходОтКР);
			Движение.Вид = Движение.Статья.ВидСтатьи;
			Движение.Валюта = Валюта;
			Движение.Сумма = гоАбс(СуммаКР);
			ЕстьРасходыДоходы = Истина;
		КонецЕсли; 
	Иначе
		Движение = Движения.НезакрытыеДокументы.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Фирма = Фирма;
		Движение.Контрагент = Контрагент;
		Движение.ВидДокумента = Перечисления.ВидДокумента.ВозвратПоставщику;
		Движение.Количество = 1;
		ЕстьНезакрытые = Истина;
	КонецЕсли; 
	
	Движения.Долги.Записывать = ЕстьДолги;
	Движения.ОстаткиТовара.Записывать = ЕстьОстатки;
	//Движения.РезервыТовара.Записывать = ЕстьРезервы;
	Движения.НезакрытыеДокументы.Записывать = ЕстьНезакрытые;
	Движения.РасходыДоходы.Записывать = ЕстьРасходыДоходы;
	Движения.Поставки.Записывать = ЕстьПоставки;    
	//+
	Движения.ПлатежныйКалендарьЗакупки.Записывать = ЕстьПлатежныйКалендарь;
	//-
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если гоАдминистратор() Тогда Возврат КонецЕсли; 
	
	Если Окончательно Тогда Сообщить("Отмена проведения невозможна! Документ закрыт {Окончательно}!"); Отказ = Истина; КонецЕсли;
	
	Если Товары.Количество() <> 0 Тогда Сообщить("Отмена проведения невозможна! Документ не пустой!"); Отказ = Истина; КонецЕсли;
	
	//Если НЕ (гоМельник() ИЛИ гоКолинко() ИЛИ гоЕстьРоль("КомуВчераСклад")) Тогда
	//	Если НачалоДня(Дата) < гоТекущаяДата() Тогда
	//		Сообщить("Только Избранный!"); Отказ = Истина; Возврат; КонецЕсли; КонецЕсли; 
КонецПроцедуры
